app/controllers/short_urls_controller.rb

  def set_resource
    @resource = ShortUrl.find_by!(shortcode: short_url_params[:id])
    @resource.increment :click_count
    @resource.save
---
INSERT INTO `short_urls` (`full_url`, `title`, `created_at`, `updated_at`) VALUES ('https://google.com', 'jEi2OJ', '2022-05-19 10:17:52.226776', '2022-05-19 10:17:52.226776')